app/views/emails/destroy.js.erb

$('.delete_email').bind('ajax:success', function() {
   $(this).closest('li').fadeOut();
   $(this).closest('li').fadeOut();

});
---
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 1]]